/*
DESCRIPTION ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░
██████████████████████████████████████████████████████████

In this little assignment you are given a string of space separated numbers, and have to return the highest and lowest number.

Examples
highAndLow("1 2 3 4 5"); // return "5 1"
highAndLow("1 2 -3 4 5"); // return "5 -3"
highAndLow("1 9 3 4 -5"); // return "9 -5"

MY SOLUTION ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░
██████████████████████████████████████████████████████████*/

function highAndLow(numbers) {
    const splitNum = numbers.split(" ");
    return `${Math.max(...splitNum)} ${Math.min(...splitNum)}`;
}

console.log(highAndLow("1 2 3 4 5"));

/*
BEST PRACTICE ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░
██████████████████████████████████████████████████████████

function highAndLow(numbers) {
    const splitNum = numbers.split(" ");
    return `${Math.max(...splitNum)} ${Math.min(...splitNum)}`;
}

WHAT DID I LEARN? ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░
██████████████████████████████████████████████████████████

Turned out when using Math.max(splitNum) without the ...spread operator, it attempts to pass the entire array as one thing to Math.max and cant be accepted. You need Math.max(...splitNum) to expand splitNum into individual elements.🤦‍♂️


*/
